[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co.com/khHN7Pk/9780143454212.jpg",
    "review": "'The Great Gatsby' by F. Scott Fitzgerald is a timeless portrayal of ambition, illusion, and the collapse of the American Dream. Set in the glittering Roaring Twenties, the novel follows the mysterious Jay Gatsby, whose lavish lifestyle conceals his longing for a lost love. Through the eyes of narrator Nick Carraway, Fitzgerald paints a haunting picture of a world driven by desire and deception. Each page glows with lyrical prose as it exposes the emptiness behind wealth and glamour. A masterpiece of modern literature, 'The Great Gatsby' continues to resonate with readers for its exploration of human hope and heartbreak.",
    "totalPages": 192,
    "rating": 4.5,
    "category": "Classic",
    "tags": ["Fiction", "Romance"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co.com/0cv102J/To-Kill-a-Mockingbird.webp",
    "review": "'To Kill a Mockingbird' by Harper Lee is a deeply moving story that captures the essence of innocence, justice, and moral courage. Through young Scout Finch’s eyes, we witness a small Southern town grappling with deep-seated racial prejudice and ethical dilemmas. Atticus Finch’s unwavering commitment to truth and empathy serves as a moral compass not just for his children but for generations of readers. Lee’s storytelling blends warmth and tragedy, illuminating the power of integrity amid ignorance. It remains one of the most profound examinations of humanity and compassion in modern American literature.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Drama", "Social Justice"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co.com/MprDyVt/51-BIA4rrae-L-AC-UF1000-1000-QL80.jpg",
    "review": "'1984' by George Orwell is an unsettling vision of a totalitarian world where freedom, individuality, and truth are crushed under relentless surveillance. Set in a grim dystopian society ruled by Big Brother, it follows Winston Smith, a man who dares to question the regime’s absolute control. Orwell’s stark prose captures the terror of psychological manipulation, propaganda, and the erasure of history. More than a novel, it is a chilling warning about the dangers of unchecked power and the loss of humanity. '1984' remains as relevant today as it was on the day it was published.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co.com/tYSWRfG/catcherrye-edited-1-800x.png",
    "review": "'The Catcher in the Rye' by J.D. Salinger captures the restless voice of adolescence through its unforgettable protagonist, Holden Caulfield. Disenchanted by the hypocrisy of the adult world, Holden wanders New York City in search of authenticity and connection. Salinger’s conversational style and raw honesty make Holden’s isolation, confusion, and defiance painfully real. Beneath the sarcasm and rebellion lies an aching tenderness—a young soul yearning to preserve innocence in a corrupt world. The novel endures as a deeply personal and universal reflection on identity, loss, and growing up.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Young Adult", "Identity"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co.com/YdQDMpn/81me-ud-V63-L-AC-UF1000-1000-QL80.jpg",
    "review": "'Pride and Prejudice' by Jane Austen is a dazzling blend of romance, wit, and social commentary that continues to charm readers centuries after its publication. Through Elizabeth Bennet’s sharp intellect and independent spirit, Austen examines class, pride, and human folly in Georgian England. The chemistry between Elizabeth and Mr. Darcy unfolds with masterful subtlety, revealing that true love requires humility and understanding. Austen’s keen observations of society and her sparkling prose make this novel a timeless study of character and love. It is every bit as relevant today as it was in the 19th century.",
    "totalPages": 279,
    "rating": 4.7,
    "category": "Classic",
    "tags": ["Romance", "Satire"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co.com/xS8YvxL/81m-CE-uclx-L-UF1000-1000-QL80.jpg",
    "review": "'The Hobbit' by J.R.R. Tolkien is a timeless adventure tale that invites readers into the enchanting realm of Middle-earth. Following Bilbo Baggins—a modest hobbit thrust into an epic quest for treasure—the novel combines humor, bravery, and friendship with mythic grandeur. Tolkien’s vivid imagination breathes life into dragons, dwarves, and magic, crafting a story that is both intimate and epic. Beneath its fantasy elements lies a meditation on courage, greed, and the comforts of home. 'The Hobbit' remains a cornerstone of modern fantasy, inspiring generations with its heart and heroism.",
    "totalPages": 310,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Adventure", "Epic"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co.com/989qMRW/42844155.jpg",
    "review": "'Harry Potter and the Sorcerer’s Stone' by J.K. Rowling marks the beginning of one of the most beloved journeys in modern literature. Through the eyes of young Harry, readers discover the magical world of Hogwarts, where courage, friendship, and imagination triumph over darkness. Rowling’s storytelling balances wonder and danger with a heartfelt sense of belonging and love. Beyond the spells and enchantments, the book speaks to the universal desire for identity and understanding. It’s a tale that continues to ignite the magic of reading in children and adults alike.",
    "totalPages": 309,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Magic", "Young Adult"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 8,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co.com/zS9jsdK/18144590.jpg",
    "review": "'The Alchemist' by Paulo Coelho is an uplifting allegory about destiny, dreams, and self-discovery. The story of Santiago, a shepherd who sets out to find hidden treasure, unfolds as a spiritual journey toward understanding one’s purpose in life. Coelho’s simple yet profound prose invites readers to listen to their hearts and trust the path before them. Filled with symbolism and wisdom, the novel blends mysticism with practicality, reminding us that the true treasure often lies within. It’s a gentle, transformative narrative that continues to inspire millions around the world.",
    "totalPages": 177,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Philosophical", "Adventure"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 9,
    "bookName": "The Girl on the Train",
    "author": "Paula Hawkins",
    "image": "https://i.ibb.co.com/P6hfCmJ/Whats-App-Image-2024-05-22-at-11-21-25-2e21ae46.jpg",
    "review": "'The Girl on the Train' by Paula Hawkins is a tightly woven psychological thriller that masterfully explores memory, obsession, and deceit. Rachel, an unreliable narrator caught between reality and illusion, becomes entangled in a missing person’s case that unravels far deeper secrets. Hawkins’ storytelling grips readers with shifting perspectives and a steady buildup of tension that never lets go. Themes of addiction, trauma, and vulnerability make this more than a whodunit—it’s a study of flawed humanity. A suspenseful, haunting read that keeps readers questioning every truth until the final page.",
    "totalPages": 316,
    "rating": 4.2,
    "category": "Mystery",
    "tags": ["Suspense", "Psychological"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2015
  }
]
